libxmlbus/data/wsaddr-testset/documents/echo/soap12/noActionRequest.xml

<?xml version="1.0"?>
<!-- $Id: noActionRequest.xml,v 1.4 2006/02/20 16:01:17 pdowney Exp $ -->
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap12:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:MessageID>urn:uuid:877D71FB-9309-417A-91FD-17473E28D1D0</wsa:MessageID>
  </soap12:Header>
  <soap12:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap12:Body>
</soap12:Envelope>
